; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	infrared8 - mode
	image2 - mode
	infrared4 - mode
	spectrograph7 - mode
	spectrograph3 - mode
	thermograph0 - mode
	thermograph6 - mode
	image5 - mode
	image1 - mode
	Star2 - direction
	Star1 - direction
	Star4 - direction
	Star3 - direction
	GroundStation0 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 infrared8)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared8)
	(supports instrument1 spectrograph7)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph6)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument3 image5)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared4)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
)
(:goal (and
	(pointing satellite0 Star6)
	(pointing satellite2 Star1)
	(pointing satellite3 Star7)
	(have_image Planet5 image2)
	(have_image Star6 image5)
	(have_image Star6 image1)
	(have_image Star7 image2)
	(have_image Planet8 spectrograph3)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 image1)
))

)

; plan
1. (turn_to satellite3 groundstation0 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 10
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 10
3. (calibrate satellite3 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 0 of 10
4. (turn_to satellite3 planet5 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet5)
   goals met: 0 of 10
5. (turn_to satellite0 star1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star1)
   goals met: 0 of 10
6. (take_image satellite3 planet5 instrument4 image2)
   added: (have_image planet5 image2)
   goals met: 1 of 10
7. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 10
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 10
9. (calibrate satellite2 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 1 of 10
10. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 10
11. (turn_to satellite0 planet8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet8)
   goals met: 1 of 10
12. (take_image satellite0 planet8 instrument0 spectrograph3)
   added: (have_image planet8 spectrograph3)
   goals met: 2 of 10
13. (turn_to satellite0 star6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star6)
   goals met: 3 of 10
14. (take_image satellite0 star6 instrument0 image5)
   added: (have_image star6 image5)
   goals met: 4 of 10
15. (turn_to satellite2 phenomenon9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon9)
   goals met: 4 of 10
16. (take_image satellite2 phenomenon9 instrument3 image1)
   added: (have_image phenomenon9 image1)
   goals met: 5 of 10
17. (turn_to satellite2 planet8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet8)
   goals met: 5 of 10
18. (take_image satellite2 planet8 instrument3 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 6 of 10
19. (turn_to satellite2 star6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star6)
   goals met: 6 of 10
20. (take_image satellite2 star6 instrument3 image1)
   added: (have_image star6 image1)
   goals met: 7 of 10
21. (turn_to satellite2 star1 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star1)
   goals met: 8 of 10
22. (turn_to satellite3 star7 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 star7)
   goals met: 9 of 10
23. (take_image satellite3 star7 instrument4 image2)
   added: (have_image star7 image2)
   goals met: 10 of 10
